src/bp-extension/DataProcessors/ЛГ_ОбменJSON.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ЛГ_ОбменJSON</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/bp-extension/Documents/ЛГ_Заявка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЛГ_Заявка</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЛогистики</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЗаявкиЛогистики</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаявкиЛогистики</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЗаявки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Загрузка_Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Загрузка_Пункт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выгрузка_Пункт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаЗаявки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаЗаявкиБезНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаИсполнителя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаИсполнителяБезНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧистаяДельта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсполнительБезНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДСИсполнителя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логист</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тягач</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прицеп</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СальдоКонечное</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БезНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выгрузка_Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Оплаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторБП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>БухгалтерскиеДокументы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтправкаДокументов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаОтправки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТрекНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Получено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОтправления</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтоимостьОтправления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресОтправки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Дебиторка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Результат</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаСледующего</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/bp-extension/Documents/СчетНаОплатуПокупателю.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СчетНаОплатуПокупателю</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЛГ_ЗаявкаОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛГ_Заявка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Содержание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/bp-extension/DataProcessors/ЛГ_ОбменJSON/Forms/Форма/Ext/Form/Module.bsl
// Модуль управляемой формы ОБРАБОТКИ.
// Реквизиты формы: ВыбраннаяЗаявка (ссылка), РезультатОперации (строка).
// Перед обменом сохраните и закройте форму выбранной заявки.

&НаКлиенте
Функция ПроверитьВыборЗаявки()
    Если Не ЗначениеЗаполнено(ВыбраннаяЗаявка) Тогда
        Сообщить("Выберите сохранённую заявку в поле «Заявка».");
        Возврат Ложь;
    КонецЕсли;
    Возврат Истина;
КонецФункции

&НаКлиенте
Процедура ОткрытьЗаявку(Команда)
    Если Не ПроверитьВыборЗаявки() Тогда
        Возврат;
    КонецЕсли;
    ОткрытьЗначение(ВыбраннаяЗаявка);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьJSON(Команда)
    Если Не ПроверитьВыборЗаявки() Тогда
        Возврат;
    КонецЕсли;
    Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
    Диалог.Заголовок = "Загрузить заявку из логистики и записать";
    Диалог.Фильтр = "Файлы JSON (*.json)|*.json";
    Диалог.МножественныйВыбор = Ложь;
    // Ссылка фиксируется до открытия диалога.
    Оповещение = Новый ОписаниеОповещения(
        "ПослеВыбораФайлаЗагрузки", ЭтотОбъект, ВыбраннаяЗаявка);
    Диалог.Показать(Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораФайлаЗагрузки(ВыбранныеФайлы, СсылкаЗаявки) Экспорт
    Если ВыбранныеФайлы = Неопределено Тогда
        Возврат;
    КонецЕсли;
    Если ВыбранныеФайлы.Количество() = 0 Тогда
        Возврат;
    КонецЕсли;
    Попытка
        ТекстовыйФайл = Новый ТекстовыйДокумент;
        ТекстовыйФайл.Прочитать(ВыбранныеФайлы[0], КодировкаТекста.UTF8);
        РезультатОперации = ЗагрузитьНаСервере(
            СсылкаЗаявки, ТекстовыйФайл.ПолучитьТекст());
    Исключение
        РезультатОперации = "Загрузка не выполнена: " + ОписаниеОшибки();
    КонецПопытки;
    Сообщить(РезультатОперации);
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьJSON(Команда)
    Если Не ПроверитьВыборЗаявки() Тогда
        Возврат;
    КонецЕсли;
    Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
    Диалог.Заголовок = "Выгрузить результат для логистики";
    Диалог.Фильтр = "Файлы JSON (*.json)|*.json";
    Диалог.ПолноеИмяФайла = "БП_Результат.json";
    Диалог.МножественныйВыбор = Ложь;
    Оповещение = Новый ОписаниеОповещения(
        "ПослеВыбораФайлаВыгрузки", ЭтотОбъект, ВыбраннаяЗаявка);
    Диалог.Показать(Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораФайлаВыгрузки(ВыбранныеФайлы, СсылкаЗаявки) Экспорт
    Если ВыбранныеФайлы = Неопределено Тогда
        Возврат;
    КонецЕсли;
    Если ВыбранныеФайлы.Количество() = 0 Тогда
        Возврат;
    КонецЕсли;
    Попытка
        ТекстJSON = ВыгрузитьНаСервере(СсылкаЗаявки);
    Исключение
        РезультатОперации = "Не удалось подготовить выгрузку: " + ОписаниеОшибки();
        Сообщить(РезультатОперации);
        Возврат;
    КонецПопытки;
    Попытка
        ТекстовыйФайл = Новый ТекстовыйДокумент;
        ТекстовыйФайл.УстановитьТекст(ТекстJSON);
        ТекстовыйФайл.Записать(ВыбранныеФайлы[0], КодировкаТекста.UTF8);
        РезультатОперации = "Выгружена заявка: " + Строка(СсылкаЗаявки)
            + ". Файл: " + ВыбранныеФайлы[0];
    Исключение
        РезультатОперации = "Данные подготовлены, но файл не сохранён: "
            + ОписаниеОшибки() + ". Выберите другой путь и повторите выгрузку.";
    КонецПопытки;
    Сообщить(РезультатОперации);
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьОплаты(Команда)
    Если Не ПроверитьВыборЗаявки() Тогда
        Возврат;
    КонецЕсли;
    Попытка
        РезультатОперации = ОбновитьОплатыНаСервере(ВыбраннаяЗаявка);
    Исключение
        РезультатОперации = "Не удалось обновить оплаты: " + ОписаниеОшибки();
    КонецПопытки;
    Сообщить(РезультатОперации);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОбновитьОплатыНаСервере(СсылкаЗаявки)
    ДокументЗаявки = ПолучитьЗаявкуДляОбмена(СсылкаЗаявки);
    ЛГ_ЗаполнитьБанковскиеОплаты(ДокументЗаявки);
    ДокументЗаявки.Записать(РежимЗаписиДокумента.Запись);
    Возврат "Банковские оплаты обновлены и заявка записана. Документов: "
        + Строка(ДокументЗаявки.Оплаты.Количество())
        + "; оплачено: " + Строка(ДокументЗаявки.СуммаОплаты)
        + "; остаток: " + Строка(ДокументЗаявки.СальдоКонечное);
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьЗаявкуДляОбмена(СсылкаЗаявки)
    Если ТипЗнч(СсылкаЗаявки) <> Тип("ДокументСсылка.ЛГ_Заявка") Тогда
        ВызватьИсключение "Передана ссылка неверного типа.";
    КонецЕсли;
    Если Не ЗначениеЗаполнено(СсылкаЗаявки) Тогда
        ВызватьИсключение "Выберите сохранённую заявку.";
    КонецЕсли;
    ДокументЗаявки = СсылкаЗаявки.ПолучитьОбъект();
    Если ДокументЗаявки = Неопределено Тогда
        ВызватьИсключение "Заявка не найдена.";
    КонецЕсли;
    Если ДокументЗаявки.ПометкаУдаления Тогда
        ВызватьИсключение "Заявка помечена на удаление.";
    КонецЕсли;
    Возврат ДокументЗаявки;
КонецФункции

&НаСервереБезКонтекста
Функция ЗагрузитьНаСервере(СсылкаЗаявки, ТекстJSON)

    Чтение = Новый ЧтениеJSON;
    Чтение.УстановитьСтроку(ТекстJSON);
    Пакет = ПрочитатьJSON(Чтение);
    Чтение.Закрыть();

    Если ТипЗнч(Пакет) <> Тип("Структура") Тогда
        ВызватьИсключение "Неверная структура JSON.";
    КонецЕсли;

    Версия = Неопределено;
    Направление = Неопределено;
    ДанныеЗаявки = Неопределено;

    Если Не Пакет.Свойство("ВерсияФормата", Версия) Тогда
        ВызватьИсключение "В файле отсутствует версия формата.";
    КонецЕсли;

    Если Версия <> 1 Тогда
        ВызватьИсключение "Поддерживается только версия формата 1.";
    КонецЕсли;

    Если Не Пакет.Свойство("Направление", Направление) Тогда
        ВызватьИсключение "В файле отсутствует направление обмена.";
    КонецЕсли;

    Если Направление <> "ЛогистикаВБухгалтерию" Тогда
        ВызватьИсключение "Этот файл не предназначен для загрузки в Бухгалтерию.";
    КонецЕсли;

    Если Не Пакет.Свойство("Заявка", ДанныеЗаявки) Тогда
        ВызватьИсключение "В файле отсутствуют данные заявки.";
    КонецЕсли;

    // Проверяем и приводим идентификатор к стандартному виду.
    Идентификатор = Строка(
        Новый УникальныйИдентификатор(
            ДанныеЗаявки.Идентификатор));

    ДокументЗаявки = ПолучитьЗаявкуДляОбмена(СсылкаЗаявки);

    Если ЗначениеЗаполнено(
        ДокументЗаявки.ИдентификаторЛогистики) Тогда

        Если ДокументЗаявки.ИдентификаторЛогистики
            <> Идентификатор Тогда

            ВызватьИсключение
                "Выбранная заявка уже связана с другой заявкой логистики. "
                + "Откройте нужную заявку или создайте новую.";

        КонецЕсли;

    КонецЕсли;

    // Не допускаем привязку одного файла к двум заявкам.
    Запрос = Новый Запрос;
    Запрос.Текст =
        "ВЫБРАТЬ
        |   Заявки.Ссылка КАК Ссылка
        |ИЗ
        |   Документ.ЛГ_Заявка КАК Заявки
        |ГДЕ
        |   Заявки.ИдентификаторЛогистики = &Идентификатор
        |   И Заявки.Ссылка <> &ТекущаяЗаявка";

    Запрос.УстановитьПараметр(
        "Идентификатор", Идентификатор);

    Запрос.УстановитьПараметр(
        "ТекущаяЗаявка", ДокументЗаявки.Ссылка);

    Выборка = Запрос.Выполнить().Выбрать();

    Если Выборка.Следующий() Тогда

        ВызватьИсключение
            "Этот файл уже связан с документом: "
            + Строка(Выборка.Ссылка)
            + ". Откройте его и выполните загрузку там.";

    КонецЕсли;

    Если Не ЗначениеЗаполнено(ДокументЗаявки.Организация)
        Или Не ЗначениеЗаполнено(ДокументЗаявки.Контрагент)
        Или Не ЗначениеЗаполнено(ДокументЗаявки.Договор) Тогда

        ВызватьИсключение
            "Заполните организацию, заказчика и договор.";

    КонецЕсли;

    Если ДокументЗаявки.Договор.Владелец
        <> ДокументЗаявки.Контрагент Тогда

        ВызватьИсключение
            "Выбранный договор принадлежит другому заказчику.";

    КонецЕсли;

    РеквизитыJSON = ДанныеЗаявки.Реквизиты;

    ДокументЗаявки.ИдентификаторЛогистики = Идентификатор;
    ДокументЗаявки.НомерЗаявкиЛогистики = ДанныеЗаявки.Номер;
    ДокументЗаявки.ДатаЗаявкиЛогистики =
        ЛГ_ДатаИзJSON(ДанныеЗаявки.Дата);

    // Переносим только согласованные реквизиты.
    // Организация, контрагент и договор берутся из сохранённой заявки.
    ИменаПолей = СтрРазделить(
        "НомерЗаявки,СрокОплаты,"
        + "Загрузка_Дата,Загрузка_Пункт,"
        + "Выгрузка_Дата,Выгрузка_Пункт,"
        + "СуммаЗаявки,СуммаЗаявкиБезНДС,"
        + "СуммаИсполнителя,СуммаИсполнителяБезНДС,"
        + "ЧистаяДельта,БезНДС,СтавкаНДС,"
        + "ИсполнительБезНДС,СтавкаНДСИсполнителя,"
        + "Логист,Отдел,Водитель,Тягач,Прицеп",
        ",");

    Для Каждого ИмяПоля Из ИменаПолей Цикл

        ЗначениеJSON = Неопределено;

        Если Не РеквизитыJSON.Свойство(
            ИмяПоля, ЗначениеJSON) Тогда

            ВызватьИсключение
                "В файле отсутствует реквизит: " + ИмяПоля;

        КонецЕсли;

        Если ДокументЗаявки.Метаданные().Реквизиты.Найти(
            ИмяПоля) = Неопределено Тогда

            ВызватьИсключение
                "В документе ЛГ_Заявка отсутствует реквизит: "
                + ИмяПоля;

        КонецЕсли;

        Если ИмяПоля = "СрокОплаты"
            Или ИмяПоля = "Загрузка_Дата"
            Или ИмяПоля = "Выгрузка_Дата" Тогда

            ДокументЗаявки[ИмяПоля] =
                ЛГ_ДатаИзJSON(ЗначениеJSON);

        ИначеЕсли ИмяПоля = "Логист"
            Или ИмяПоля = "Отдел"
            Или ИмяПоля = "Водитель"
            Или ИмяПоля = "Тягач"
            Или ИмяПоля = "Прицеп" Тогда

            ДокументЗаявки[ИмяПоля] =
                ЛГ_НаименованиеИзJSON(ЗначениеJSON);

        Иначе

            ДокументЗаявки[ИмяПоля] = ЗначениеJSON;

        КонецЕсли;

    КонецЦикла;

    // Эти таблицы загружаются целиком, поэтому строки не дублируются.
    ИменаТаблиц = СтрРазделить(
        "ОтправкаДокументов,Дебиторка", ",");

    Для Каждого ИмяТаблицы Из ИменаТаблиц Цикл

        СтрокиJSON = Неопределено;

        Если Не ДанныеЗаявки.ТабличныеЧасти.Свойство(
            ИмяТаблицы, СтрокиJSON) Тогда

            ВызватьИсключение
                "В файле отсутствует таблица: " + ИмяТаблицы;

        КонецЕсли;

        ОписаниеТаблицы =
            ДокументЗаявки.Метаданные().ТабличныеЧасти.Найти(
                ИмяТаблицы);

        Если ОписаниеТаблицы = Неопределено Тогда

            ВызватьИсключение
                "В документе отсутствует таблица: " + ИмяТаблицы;

        КонецЕсли;

        ТаблицаДокумента = ДокументЗаявки[ИмяТаблицы];
        ТаблицаДокумента.Очистить();

        Для Каждого СтрокаJSON Из СтрокиJSON Цикл

            НоваяСтрока = ТаблицаДокумента.Добавить();

            Для Каждого Колонка Из ОписаниеТаблицы.Реквизиты Цикл

                ЗначениеJSON = Неопределено;

                Если СтрокаJSON.Свойство(
                    Колонка.Имя, ЗначениеJSON) Тогда

                    Если Колонка.Тип.СодержитТип(Тип("Дата")) Тогда

                        НоваяСтрока[Колонка.Имя] =
                            ЛГ_ДатаИзJSON(ЗначениеJSON);

                    Иначе

                        НоваяСтрока[Колонка.Имя] = ЗначениеJSON;

                    КонецЕсли;

                КонецЕсли;

            КонецЦикла;

        КонецЦикла;

    КонецЦикла;

    // Оплаты и бухгалтерские документы не загружаем из логистики.
    ДокументЗаявки.СуммаОплаты =
        ДокументЗаявки.Оплаты.Итог("Сумма");

    ДокументЗаявки.СальдоКонечное =
        ДокументЗаявки.СуммаЗаявки - ДокументЗаявки.СуммаОплаты;

    // Запись выполняется после заполнения и формирования сообщения.


    СообщениеРезультата =
        "Загружена заявка логистики № " + ДанныеЗаявки.Номер
        + ". Заказчик в файле: "
        + ЛГ_НаименованиеИзJSON(РеквизитыJSON.Контрагент)
        + "; договор в файле: "
        + ЛГ_НаименованиеИзJSON(РеквизитыJSON.Договор)
        + ". Проверьте выбранные организацию, заказчика и договор. "
        + "Заявка записана.";

    ДокументЗаявки.Записать(РежимЗаписиДокумента.Запись);
    Возврат СообщениеРезультата;

КонецФункции

&НаСервереБезКонтекста
Функция ЛГ_ДатаИзJSON(ЗначениеJSON)

    Если ЗначениеJSON = Неопределено
        Или ЗначениеJSON = Null Тогда

        Возврат Дата(1, 1, 1);

    КонецЕсли;

    Если ТипЗнч(ЗначениеJSON) <> Тип("Строка") Тогда
        ВызватьИсключение "Дата в JSON должна быть строкой.";
    КонецЕсли;

    Если СтрДлина(ЗначениеJSON) <> 19 Тогда

        ВызватьИсключение
            "Неверный формат даты: " + ЗначениеJSON;

    КонецЕсли;

    Возврат Дата(
        Число(Сред(ЗначениеJSON, 1, 4)),
        Число(Сред(ЗначениеJSON, 6, 2)),
        Число(Сред(ЗначениеJSON, 9, 2)),
        Число(Сред(ЗначениеJSON, 12, 2)),
        Число(Сред(ЗначениеJSON, 15, 2)),
        Число(Сред(ЗначениеJSON, 18, 2)));

КонецФункции

&НаСервереБезКонтекста
Функция ЛГ_НаименованиеИзJSON(ЗначениеJSON)

    Если ЗначениеJSON = Неопределено
        Или ЗначениеJSON = Null Тогда

        Возврат "";

    КонецЕсли;

    Если ТипЗнч(ЗначениеJSON) <> Тип("Структура") Тогда

        ВызватьИсключение
            "Неверный формат ссылки на справочник в JSON.";

    КонецЕсли;

    Наименование = "";

    Если Не ЗначениеJSON.Свойство(
        "Наименование", Наименование) Тогда

        ВызватьИсключение
            "В данных справочника отсутствует наименование.";

    КонецЕсли;

    Возврат Наименование;

КонецФункции

&НаСервереБезКонтекста
Функция ВыгрузитьНаСервере(СсылкаЗаявки)

    ДокументЗаявки = ПолучитьЗаявкуДляОбмена(СсылкаЗаявки);

    Если Не ЗначениеЗаполнено(
        ДокументЗаявки.ИдентификаторЛогистики) Тогда

        ВызватьИсключение
            "Не заполнен идентификатор заявки логистики.";

    КонецЕсли;

    // Проверяем корректность идентификатора.
    ИдентификаторЛогистики = Строка(
        Новый УникальныйИдентификатор(
            ДокументЗаявки.ИдентификаторЛогистики));

    // Полный снимок актуальных проведённых банковских поступлений.
    // Изменения пока только в памяти; запись после формирования JSON.
    ЛГ_ЗаполнитьБанковскиеОплаты(ДокументЗаявки);

    // Получаем счета, связанные с этой заявкой.
    Запрос = Новый Запрос;
    Запрос.Текст =
        "ВЫБРАТЬ
        |   Счета.Ссылка КАК Ссылка,
        |   Счета.Номер КАК Номер,
        |   Счета.Дата КАК Дата,
        |   Счета.СуммаДокумента КАК Сумма,
        |   Счета.Проведен КАК Проведен
        |ИЗ
        |   Документ.СчетНаОплатуПокупателю КАК Счета
        |ГДЕ
        |   Счета.ЛГ_ЗаявкаОснование = &Заявка
        |   И НЕ Счета.ПометкаУдаления
        |УПОРЯДОЧИТЬ ПО
        |   Счета.Дата,
        |   Счета.Номер";

    Запрос.УстановитьПараметр(
        "Заявка", ДокументЗаявки.Ссылка);

    ДокументыJSON = Новый Массив;
    Выборка = Запрос.Выполнить().Выбрать();

    Пока Выборка.Следующий() Цикл

        ДанныеСчета = Новый Структура;

        ДанныеСчета.Вставить(
            "ИдентификаторБП",
            Строка(Выборка.Ссылка.УникальныйИдентификатор()));

        ДанныеСчета.Вставить(
            "ТипДокумента", "СчетНаОплатуПокупателю");

        ДанныеСчета.Вставить(
            "ВидДокумента", "Счет покупателю");

        ДанныеСчета.Вставить("Номер", Выборка.Номер);

        ДанныеСчета.Вставить(
            "Дата", ЛГ_ДатаДляОбратногоJSON(Выборка.Дата));

        ДанныеСчета.Вставить("Сумма", Выборка.Сумма);
        ДанныеСчета.Вставить("Проведен", Выборка.Проведен);
        ДанныеСчета.Вставить("Комментарий", "");

        ДокументыJSON.Добавить(ДанныеСчета);

    КонецЦикла;

    // Выгружаем оплаты из таблицы нашей заявки.
    ОплатыJSON = Новый Массив;

    Для Каждого СтрокаОплаты Из ДокументЗаявки.Оплаты Цикл

        ДанныеОплаты = Новый Структура;

        ДанныеОплаты.Вставить(
            "ИдентификаторБП",
            СтрокаОплаты.ИдентификаторБП);

        ДанныеОплаты.Вставить(
            "Дата",
            ЛГ_ДатаДляОбратногоJSON(СтрокаОплаты.Дата));

        ДанныеОплаты.Вставить(
            "НомерДокумента",
            СтрокаОплаты.НомерДокумента);

        ДанныеОплаты.Вставить(
            "Сумма", СтрокаОплаты.Сумма);

        ДанныеОплаты.Вставить(
            "Комментарий", СтрокаОплаты.Комментарий);

        ОплатыJSON.Добавить(ДанныеОплаты);

    КонецЦикла;

    СуммаОплаты = ДокументЗаявки.Оплаты.Итог("Сумма");

    ДанныеЗаявки = Новый Структура;

    ДанныеЗаявки.Вставить(
        "ИдентификаторЛогистики", ИдентификаторЛогистики);

    ДанныеЗаявки.Вставить(
        "ИдентификаторБП",
        Строка(ДокументЗаявки.Ссылка.УникальныйИдентификатор()));

    ДанныеЗаявки.Вставить(
        "НомерЗаявкиЛогистики",
        ДокументЗаявки.НомерЗаявкиЛогистики);

    ДанныеЗаявки.Вставить(
        "НомерЗаявкиБП", ДокументЗаявки.Номер);

    ДанныеЗаявки.Вставить(
        "СуммаЗаявки", ДокументЗаявки.СуммаЗаявки);

    ДанныеЗаявки.Вставить("СуммаОплаты", СуммаОплаты);

    ДанныеЗаявки.Вставить(
        "ОстатокКОплате",
        ДокументЗаявки.СуммаЗаявки - СуммаОплаты);

    ДанныеЗаявки.Вставить(
        "БухгалтерскиеДокументы", ДокументыJSON);

    ДанныеЗаявки.Вставить("Оплаты", ОплатыJSON);

    Пакет = Новый Структура;
    Пакет.Вставить("ВерсияФормата", 1);
    Пакет.Вставить("Направление", "БухгалтерияВЛогистику");

    // Массивы содержат полный текущий набор связанных счетов
    // и оплат заявки, а не только изменения.
    Пакет.Вставить("РежимПередачи", "ПолныйСнимок");

    Пакет.Вставить(
        "ДатаВыгрузки",
        ЛГ_ДатаДляОбратногоJSON(ТекущаяДата()));

    Пакет.Вставить("Заявка", ДанныеЗаявки);

    Запись = Новый ЗаписьJSON;
    Запись.УстановитьСтроку();
    ЗаписатьJSON(Запись, Пакет);

    ТекстJSON = Запись.Закрыть();
    ДокументЗаявки.Записать(РежимЗаписиДокумента.Запись);
    Возврат ТекстJSON;

КонецФункции

&НаСервереБезКонтекста
Функция ЛГ_ДатаДляОбратногоJSON(ЗначениеДаты)

    Если Не ЗначениеЗаполнено(ЗначениеДаты) Тогда
        Возврат Неопределено;
    КонецЕсли;

    Возврат Формат(
        ЗначениеДаты, "ДФ=yyyy-MM-dd'T'HH:mm:ss");

	КонецФункции

&НаСервереБезКонтекста
Процедура ЛГ_ЗаполнитьБанковскиеОплаты(ДокументЗаявки)

    Если Не ЗначениеЗаполнено(ДокументЗаявки.Организация)
        Или Не ЗначениеЗаполнено(ДокументЗаявки.Контрагент) Тогда
        ВызватьИсключение "В заявке не заполнены организация или заказчик.";
    КонецЕсли;
    Запрос = Новый Запрос;

    Запрос.Текст =
        "ВЫБРАТЬ
        |   Расшифровка.Ссылка КАК Платеж,
        |   Расшифровка.Ссылка.Номер КАК Номер,
        |   Расшифровка.Ссылка.Дата КАК Дата,
        |   СУММА(Расшифровка.СуммаПлатежа) КАК Сумма
        |ИЗ
        |   Документ.ПоступлениеНаРасчетныйСчет.РасшифровкаПлатежа
        |       КАК Расшифровка
        |       ВНУТРЕННЕЕ СОЕДИНЕНИЕ
        |           Документ.СчетНаОплатуПокупателю КАК Счета
        |       ПО Расшифровка.СчетНаОплату = Счета.Ссылка
        |ГДЕ
        |   Счета.ЛГ_ЗаявкаОснование = &Заявка
        |   И НЕ Счета.ПометкаУдаления
        |   И Расшифровка.Ссылка.Проведен
        |   И НЕ Расшифровка.Ссылка.ПометкаУдаления
        |   И Расшифровка.Ссылка.Организация = &Организация
        |   И Расшифровка.Ссылка.Контрагент = &Контрагент
        |
        |СГРУППИРОВАТЬ ПО
        |   Расшифровка.Ссылка,
        |   Расшифровка.Ссылка.Номер,
        |   Расшифровка.Ссылка.Дата
        |
        |УПОРЯДОЧИТЬ ПО
        |   Дата,
        |   Номер";

    Запрос.УстановитьПараметр(
        "Заявка", ДокументЗаявки.Ссылка);

    Запрос.УстановитьПараметр(
        "Организация", ДокументЗаявки.Организация);

    Запрос.УстановитьПараметр(
        "Контрагент", ДокументЗаявки.Контрагент);

    // Сначала выполняем запрос.
    // Если запрос завершится ошибкой, документ не будет записан.
    ТаблицаОплат = Запрос.Выполнить().Выгрузить();



    // Здесь оплаты полностью заменяются банковскими платежами.
    ДокументЗаявки.Оплаты.Очистить();

    Для Каждого БанковскийПлатеж Из ТаблицаОплат Цикл

        НоваяСтрока = ДокументЗаявки.Оплаты.Добавить();

        НоваяСтрока.ИдентификаторБП = Строка(
            БанковскийПлатеж.Платеж.УникальныйИдентификатор());

        НоваяСтрока.Дата = БанковскийПлатеж.Дата;
        НоваяСтрока.НомерДокумента = БанковскийПлатеж.Номер;
        НоваяСтрока.Сумма = БанковскийПлатеж.Сумма;

        НоваяСтрока.Комментарий =
            "Поступление на расчетный счет № "
            + СокрЛП(БанковскийПлатеж.Номер);

    КонецЦикла;

    ДокументЗаявки.СуммаОплаты =
        ДокументЗаявки.Оплаты.Итог("Сумма");

    ДокументЗаявки.СальдоКонечное =
        ДокументЗаявки.СуммаЗаявки
        - ДокументЗаявки.СуммаОплаты;



КонецПроцедуры
